def spy_game(nums):
    sequence = [0, 0, 7]
    
    for num in nums:
        if num == sequence[0]: 
            sequence.pop(0)  
        if not sequence:  
            return True
    return False  

print(spy_game([1, 2, 4, 0, 0, 7, 5])) 
print(spy_game([1, 0, 2, 4, 0, 5, 7])) 
print(spy_game([1, 7, 2, 0, 4, 5, 0])) 

#Эта функция работает путем итерации по каждому числу во входном списке. 
#Она проверяет, совпадает ли текущее число с первым элементом списка последовательности ([0, 0, 7]). 
#Если совпадение найдено, она удаляет первый элемент из последовательности. 
#Таким образом, функция отслеживает, были ли найдены 0, 0 и 7 в таком порядке. 
#Если список последовательностей становится пустым, это означает, что 007 найдено в правильном порядке, и функция возвращает True. 
#Если итерация завершается, а последовательность не найдена, функция возвращает False.